scripts/putida_stir_small/nonreact/0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [1 -1 -2 0 0 0 0];

#include "${FOAM_CASE}/constant/globalTransport"

internalField       uniform $P0;

boundaryField
{

    #includeEtc "caseDicts/setConstraintTypes"
  
    inlet
    {
        type               fixedFluxPressure;
        value              $internalField;
    }
    outlet
    {
        type               prghPressure;
        p                  $internalField;
        value              $internalField;
    }
    walls
    {
        type               fixedFluxPressure;
        value              $internalField;
    }
    propeller
    {
        type               fixedFluxPressure;
        value              $internalField;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
